In [168]:
import pandas as pd

In [169]:
contacts = {
            'name': ['Susan Calvin', 'Bently Powell', 'Gregory Powell', 'Mike Donovan'],
            'city': ['London', 'Kathmandu', 'Moskow', 'Bangalore'],
            'phone': ['056152358', '096523995', '895712365', '886549702'],
            'age' : ['28', '42', '66', '67'],
            'e-mail': ['SusanCalvin@email.com', 'BentlyP@email.com', 'GregP14@email.com', 'MDonovan@email.com']
            }

In [170]:
# create a dataframe that can be worked with pandas
df = pd.DataFrame(contacts)

In [171]:
# print the dataframe, that's the best way to do so.
df

             name       city      phone age                 e-mail
0    Susan Calvin     London  056152358  28  SusanCalvin@email.com
1   Bently Powell  Kathmandu  096523995  42      BentlyP@email.com
2  Gregory Powell     Moskow  895712365  66      GregP14@email.com
3    Mike Donovan  Bangalore  886549702  67     MDonovan@email.com

In [172]:
# shape of the df (rows, columns)
df.shape

(4, 5)

In [173]:
df.columns

Index(['name', 'city', 'phone', 'age', 'e-mail'], dtype='object')

### Working with columns

In [174]:
# select a column
df['name']

0      Susan Calvin
1     Bently Powell
2    Gregory Powell
3      Mike Donovan
Name: name, dtype: object

In [175]:
# selecting 2 or more columns, notice the extra braket
df[['name', 'city']]

             name       city
0    Susan Calvin     London
1   Bently Powell  Kathmandu
2  Gregory Powell     Moskow
3    Mike Donovan  Bangalore

In [176]:
# select an entry on a given column
df['e-mail'][1]

'BentlyP@email.com'

### Renaming columns

In [177]:
# observe that it's a list
df.columns

Index(['name', 'city', 'phone', 'age', 'e-mail'], dtype='object')

In [178]:
# renaming all at once
df.columns = ['NAME', 'CITY', 'PHONE', 'AGE', 'E-MAIL']
df

             NAME       CITY      PHONE AGE                 E-MAIL
0    Susan Calvin     London  056152358  28  SusanCalvin@email.com
1   Bently Powell  Kathmandu  096523995  42      BentlyP@email.com
2  Gregory Powell     Moskow  895712365  66      GregP14@email.com
3    Mike Donovan  Bangalore  886549702  67     MDonovan@email.com

In [180]:
# using list comprehension
df.columns = [x.lower() for x in df.columns]
df

             name       city      phone age                 e-mail
0    Susan Calvin     London  056152358  28  SusanCalvin@email.com
1   Bently Powell  Kathmandu  096523995  42      BentlyP@email.com
2  Gregory Powell     Moskow  895712365  66      GregP14@email.com
3    Mike Donovan  Bangalore  886549702  67     MDonovan@email.com

In [181]:
# item by item
df.rename(columns = {'name': 'full_name', 'e-mail': 'email'}, inplace=True)
df

        full_name       city      phone age                  email
0    Susan Calvin     London  056152358  28  SusanCalvin@email.com
1   Bently Powell  Kathmandu  096523995  42      BentlyP@email.com
2  Gregory Powell     Moskow  895712365  66      GregP14@email.com
3    Mike Donovan  Bangalore  886549702  67     MDonovan@email.com

### Working with rows
The most common way to access rows are from 2 comands **iloc** and **loc**.
* iloc uses numbered index to access items.
* loc can use column labels to access items and it gives more options.

In [182]:
df.iloc[3]

full_name          Mike Donovan
city                  Bangalore
phone                 886549702
age                          67
email        MDonovan@email.com
Name: 3, dtype: object

In [183]:
# to access more than one column or row use the brakets
df.loc[[1,3,0], ['full_name', 'email']]

       full_name                  email
1  Bently Powell      BentlyP@email.com
3   Mike Donovan     MDonovan@email.com
0   Susan Calvin  SusanCalvin@email.com

In [184]:
# no brakets needed to slicing, differently to the python standard the stop index is inclusive
# [row, column]
df.loc[1:3, 'full_name':'phone']

        full_name       city      phone
1   Bently Powell  Kathmandu  096523995
2  Gregory Powell     Moskow  895712365
3    Mike Donovan  Bangalore  886549702

### Indexing

In [185]:
# set email column as index. To apply the change inplace must be True.
df.set_index('email', inplace=True)
df

                            full_name       city      phone age
email
SusanCalvin@email.com    Susan Calvin     London  056152358  28
BentlyP@email.com       Bently Powell  Kathmandu  096523995  42
GregP14@email.com      Gregory Powell     Moskow  895712365  66
MDonovan@email.com       Mike Donovan  Bangalore  886549702  67

In [186]:
# now the email is used as the index and loc cannot use the index numbers anymore 
df.loc['GregP14@email.com']

full_name    Gregory Powell
city                 Moskow
phone             895712365
age                      66
Name: GregP14@email.com, dtype: object

In [187]:
df.loc['MDonovan@email.com', ['full_name', 'phone']]

full_name    Mike Donovan
phone           886549702
Name: MDonovan@email.com, dtype: object

In [188]:
# iloc can still be used with the index number
df.iloc[1]

full_name    Bently Powell
city             Kathmandu
phone            096523995
age                     42
Name: BentlyP@email.com, dtype: object

In [189]:
# sorting the index, ascending order is the default
df.sort_index(inplace=True)
df

                            full_name       city      phone age
email
BentlyP@email.com       Bently Powell  Kathmandu  096523995  42
GregP14@email.com      Gregory Powell     Moskow  895712365  66
MDonovan@email.com       Mike Donovan  Bangalore  886549702  67
SusanCalvin@email.com    Susan Calvin     London  056152358  28

In [190]:
# sorting the index in the descent order 
df.sort_index(ascending=False, inplace=True)
df

                            full_name       city      phone age
email
SusanCalvin@email.com    Susan Calvin     London  056152358  28
MDonovan@email.com       Mike Donovan  Bangalore  886549702  67
GregP14@email.com      Gregory Powell     Moskow  895712365  66
BentlyP@email.com       Bently Powell  Kathmandu  096523995  42

In [191]:
# to reset the index
df.reset_index(inplace=True)
df

                   email       full_name       city      phone age
0  SusanCalvin@email.com    Susan Calvin     London  056152358  28
1     MDonovan@email.com    Mike Donovan  Bangalore  886549702  67
2      GregP14@email.com  Gregory Powell     Moskow  895712365  66
3      BentlyP@email.com   Bently Powell  Kathmandu  096523995  42

### Adding/removing Columns

In [ ]:
df[']

### Filtering